src/src/AccumulationRegisters/SalesTarget.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>SalesTarget</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ObsoleteAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>PlanningPeriod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PlanningPeriods</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Products</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>PlanningDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesTarget</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/AccumulationRegisters/SalesTarget/Ext/ManagerModule.bsl
#Region InfobaseUpdate

Procedure ExcludeVATAmount() Export
	
	Query = New Query;
	
	Query.Text =
	"SELECT DISTINCT
	|	SalesTarget.Recorder AS Recorder
	|FROM
	|	AccumulationRegister.SalesTarget AS SalesTarget
	|WHERE
	|	SalesTarget.ObsoleteAmount <> 0
	|	AND SalesTarget.Amount = 0";
	
	Sel = Query.Execute().Select();
	
	While Sel.Next() Do
		
		Query.SetParameter("Recorder", Sel.Recorder);
		Query.Text =
		"SELECT
		|	SalesTarget.Period AS Period,
		|	SalesTarget.Active AS Active,
		|	SalesTarget.Company AS Company,
		|	SalesTarget.StructuralUnit AS StructuralUnit,
		|	SalesTarget.PlanningPeriod AS PlanningPeriod,
		|	SalesTarget.Products AS Products,
		|	SalesTarget.Characteristic AS Characteristic,
		|	SalesTarget.SalesOrder AS SalesOrder,
		|	SalesTarget.PlanningDocument AS PlanningDocument,
		|	SalesTarget.Quantity AS Quantity,
		|	SalesTarget.ObsoleteAmount - SalesTarget.VATAmount AS Amount,
		|	SalesTarget.VATAmount AS VATAmount,
		|	SalesTarget.ObsoleteAmount AS ObsoleteAmount
		|FROM
		|	AccumulationRegister.SalesTarget AS SalesTarget
		|WHERE
		|	SalesTarget.Recorder = &Recorder
		|
		|ORDER BY
		|	SalesTarget.LineNumber";
		
		RecordSet = AccumulationRegisters.SalesTarget.CreateRecordSet();
		RecordSet.Filter.Recorder.Set(Sel.Recorder);
		RecordSet.Load(Query.Execute().Unload());
		RecordSet.Write();
		
	EndDo;
	
EndProcedure

#EndRegion
